#![allow(non_upper_case_globals, non_camel_case_types, non_snake_case, unused)]
/* automatically generated by rust-bindgen 0.69.4 */

pub const CY_WCM_MAX_SSID_LEN: u32 = 32;
pub const CY_WCM_MAX_PASSPHRASE_LEN: u32 = 63;
pub const CY_WCM_MIN_PASSPHRASE_LEN: u32 = 8;
pub const CY_WCM_MAC_ADDR_LEN: u32 = 6;
pub const CY_WCM_MAX_IE_LENGTH: u32 = 3;
pub const CY_WCM_WPS_PIN_LENGTH: u32 = 9;
pub const CY_WCM_MAXIMUM_CALLBACKS_COUNT: u32 = 5;
#[doc = " @brief Provides the result of an operation as a structured bitfield.\n\n @note A newer version @ref cy_rslt_decode_t is also available for improved\n debugging experience.\n\n See the \\ref anchor_general_description \"General Description\"\n for more details on structure and usage."]
pub type cy_rslt_t = u32;
#[doc = "< Initial assoc."]
pub const cy_wcm_reason_code_CY_WCM_REASON_INITIAL_ASSOC: cy_wcm_reason_code = 0;
#[doc = "< Roamed due to low RSSI."]
pub const cy_wcm_reason_code_CY_WCM_REASON_LOW_RSSI: cy_wcm_reason_code = 1;
#[doc = "< Roamed due to DEAUTH indication."]
pub const cy_wcm_reason_code_CY_WCM_REASON_DEAUTH: cy_wcm_reason_code = 2;
#[doc = "< Roamed due to DISASSOC indication."]
pub const cy_wcm_reason_code_CY_WCM_REASON_DISASSOC: cy_wcm_reason_code = 3;
#[doc = "< Roamed due to lost beacons."]
pub const cy_wcm_reason_code_CY_WCM_REASON_BCNS_LOST: cy_wcm_reason_code = 4;
#[doc = "< Roamed due to fast roam failure."]
pub const cy_wcm_reason_code_CY_WCM_REASON_FAST_ROAM_FAILED: cy_wcm_reason_code = 5;

#[doc = "< RSSI-based scan filtering."]
pub const cy_wcm_scan_filter_type_t_CY_WCM_SCAN_FILTER_TYPE_RSSI: cy_wcm_scan_filter_type_t = 3;
#[doc = " Enumeration of scan filter types"]
pub type cy_wcm_scan_filter_type_t = u32;
#[doc = "< Infrastructure network."]
pub const cy_wcm_bss_type_t_CY_WCM_BSS_TYPE_INFRASTRUCTURE: cy_wcm_bss_type_t = 0;
#[doc = "< 802.11 ad hoc IBSS network."]
pub const cy_wcm_bss_type_t_CY_WCM_BSS_TYPE_ADHOC: cy_wcm_bss_type_t = 1;
#[doc = "< Either infrastructure or ad hoc network."]
pub const cy_wcm_bss_type_t_CY_WCM_BSS_TYPE_ANY: cy_wcm_bss_type_t = 2;
#[doc = "< 802.11 mesh network."]
pub const cy_wcm_bss_type_t_CY_WCM_BSS_TYPE_MESH: cy_wcm_bss_type_t = 3;
#[doc = "< Returned by \\ref cy_wcm_scan_result_callback_t if BSS type is unknown. Do not pass this to the Join function."]
pub const cy_wcm_bss_type_t_CY_WCM_BSS_TYPE_UNKNOWN: cy_wcm_bss_type_t = -1;
#[doc = " Enumeration of network types"]
pub type cy_wcm_bss_type_t = i32;
#[doc = "< Denotes mask for beacon packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_BEACON: cy_wcm_ie_mask_t = 1;
#[doc = "< Denotes mask for probe response packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_PROBE_RESPONSE: cy_wcm_ie_mask_t = 2;
#[doc = "< Denotes mask for association response packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_ASSOC_RESPONSE: cy_wcm_ie_mask_t = 4;
#[doc = "< Denotes mask for authentication response packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_AUTH_RESPONSE: cy_wcm_ie_mask_t = 8;
#[doc = "< Denotes mask for probe request packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_PROBE_REQUEST: cy_wcm_ie_mask_t = 16;
#[doc = "< Denotes mask for association request packet."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_ASSOC_REQUEST: cy_wcm_ie_mask_t = 32;
#[doc = "< Denotes mask for custom IE identifier."]
pub const cy_wcm_ie_mask_t_CY_WCM_IE_MASK_CUSTOM: cy_wcm_ie_mask_t = 256;
#[doc = " Enumeration of applicable packet mask bits for custom information elements (IEs)"]
pub type cy_wcm_ie_mask_t = u32;
#[doc = " \\addtogroup group_wcm_typedefs\n \\{\n/\n/******************************************************\n                      Typedefs"]
pub type cy_wcm_ssid_t = [u8; 33usize];
pub type cy_wcm_mac_t = [u8; 6usize];
pub type cy_wcm_passphrase_t = [u8; 64usize];
#[doc = " Structure used to pass WPS configuration parameters to \\ref cy_wcm_wps_enrollee.\n Password is mandatory only for CY_WCM_WPS_PIN mode and not used when mode is CY_WCM_WPS_PBC."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_wps_config_t {
    #[doc = "< WPS mode."]
    pub mode: cy_wcm_wps_mode_t,
    #[doc = "< Used only for CY_WCM_WPS_PIN mode."]
    pub password: *mut ::core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_cy_wcm_wps_config_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_wps_config_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_wps_config_t>(),
        16usize,
        concat!("Size of: ", stringify!(cy_wcm_wps_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_wps_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_wps_config_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_config_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_config_t),
            "::",
            stringify!(password)
        )
    );
}
#[doc = " Structure used to pass WCM configuration to \\ref cy_wcm_init."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_config_t {
    #[doc = "< Interface type."]
    pub interface: cy_wcm_interface_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_config_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_config_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_config_t>(),
        4usize,
        concat!("Size of: ", stringify!(cy_wcm_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_config_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_config_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_config_t),
            "::",
            stringify!(interface)
        )
    );
}
#[doc = " Structure used to receive the IP address information from \\ref cy_wcm_connect_ap."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cy_wcm_ip_address_t {
    #[doc = "< IP version."]
    pub version: cy_wcm_ip_version_t,
    #[doc = "< IP address bytes."]
    pub ip: cy_wcm_ip_address_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cy_wcm_ip_address_t__bindgen_ty_1 {
    #[doc = "< IPv4 address in network byte order."]
    pub v4: u32,
    #[doc = "< IPv6 address in network byte order."]
    pub v6: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_cy_wcm_ip_address_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_ip_address_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_ip_address_t__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(cy_wcm_ip_address_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_ip_address_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cy_wcm_ip_address_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v4) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_address_t__bindgen_ty_1),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v6) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_address_t__bindgen_ty_1),
            "::",
            stringify!(v6)
        )
    );
}
#[test]
fn bindgen_test_layout_cy_wcm_ip_address_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_ip_address_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_ip_address_t>(),
        20usize,
        concat!("Size of: ", stringify!(cy_wcm_ip_address_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_ip_address_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_ip_address_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_address_t),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ip) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_address_t),
            "::",
            stringify!(ip)
        )
    );
}
#[doc = " Structure used to receive the IP address of the STA or MAC address of the connected STA to SoftAP through the callback registered using \\ref cy_wcm_register_event_callback."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union cy_wcm_event_data_t {
    #[doc = "< Contains the IP address for the CY_WCM_EVENT_IP_CHANGED event."]
    pub ip_addr: cy_wcm_ip_address_t,
    #[doc = "< MAC address of the STA for the CY_WCM_EVENT_STA_JOINED or CY_WCM_EVENT_STA_LEFT"]
    pub sta_mac: cy_wcm_mac_t,
    #[doc = "< Reason code which specifies the reason for disconnection."]
    pub reason: cy_wcm_reason_code,
}
#[test]
fn bindgen_test_layout_cy_wcm_event_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_event_data_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_event_data_t>(),
        20usize,
        concat!("Size of: ", stringify!(cy_wcm_event_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_event_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_event_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ip_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_event_data_t),
            "::",
            stringify!(ip_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sta_mac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_event_data_t),
            "::",
            stringify!(sta_mac)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_event_data_t),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = " Structure used for providing the AP credential to connect to a AP using \\ref cy_wcm_connect_ap."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_ap_credentials_t {
    #[doc = "< SSID of the Wi-Fi network to join; should be a null-terminated string."]
    pub SSID: cy_wcm_ssid_t,
    #[doc = "< Password needed to join the AP; should be a null-terminated string."]
    pub password: cy_wcm_passphrase_t,
    #[doc = "< Wi-Fi Security. @see cy_wcm_security_t."]
    pub security: cy_wcm_security_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_ap_credentials_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_ap_credentials_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_ap_credentials_t>(),
        104usize,
        concat!("Size of: ", stringify!(cy_wcm_ap_credentials_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_ap_credentials_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_ap_credentials_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_credentials_t),
            "::",
            stringify!(SSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).password) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_credentials_t),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_credentials_t),
            "::",
            stringify!(security)
        )
    );
}
#[doc = " Structure used to pass the static IP address information to \\ref cy_wcm_connect_ap.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cy_wcm_ip_setting_t {
    #[doc = "< IP address."]
    pub ip_address: cy_wcm_ip_address_t,
    #[doc = "< Gateway address."]
    pub gateway: cy_wcm_ip_address_t,
    #[doc = "< Netmask."]
    pub netmask: cy_wcm_ip_address_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_ip_setting_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_ip_setting_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_ip_setting_t>(),
        60usize,
        concat!("Size of: ", stringify!(cy_wcm_ip_setting_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_ip_setting_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_ip_setting_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ip_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_setting_t),
            "::",
            stringify!(ip_address)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gateway) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_setting_t),
            "::",
            stringify!(gateway)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).netmask) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ip_setting_t),
            "::",
            stringify!(netmask)
        )
    );
}
#[doc = " Structure used to pass the Wi-Fi connection parameter information to \\ref cy_wcm_connect_ap.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_connect_params_t {
    #[doc = "< AP credentials."]
    pub ap_credentials: cy_wcm_ap_credentials_t,
    #[doc = "< MAC address of the AP (optional)."]
    pub BSSID: cy_wcm_mac_t,
    #[doc = "< Static IP settings of the device (optional)."]
    pub static_ip_settings: *mut cy_wcm_ip_setting_t,
    #[doc = "< Radio band to be connected (optional)."]
    pub band: cy_wcm_wifi_band_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_connect_params_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_connect_params_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_connect_params_t>(),
        128usize,
        concat!("Size of: ", stringify!(cy_wcm_connect_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_connect_params_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_connect_params_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ap_credentials) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_connect_params_t),
            "::",
            stringify!(ap_credentials)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSSID) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_connect_params_t),
            "::",
            stringify!(BSSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).static_ip_settings) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_connect_params_t),
            "::",
            stringify!(static_ip_settings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_connect_params_t),
            "::",
            stringify!(band)
        )
    );
}
#[doc = " Structure used to pass scan filters to \\ref cy_wcm_start_scan."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cy_wcm_scan_filter_t {
    #[doc = "< Scan filter mode."]
    pub mode: cy_wcm_scan_filter_type_t,
    #[doc = "< Parameter specific to scan filter mode."]
    pub param: cy_wcm_scan_filter_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cy_wcm_scan_filter_t__bindgen_ty_1 {
    #[doc = "< SSID."]
    pub SSID: cy_wcm_ssid_t,
    #[doc = "< MAC address of AP."]
    pub BSSID: cy_wcm_mac_t,
    #[doc = "< Radio band."]
    pub band: cy_wcm_wifi_band_t,
    #[doc = "< RSSI range."]
    pub rssi_range: cy_wcm_scan_rssi_range_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_scan_filter_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_scan_filter_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_scan_filter_t__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(cy_wcm_scan_filter_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_scan_filter_t__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(cy_wcm_scan_filter_t__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t__bindgen_ty_1),
            "::",
            stringify!(SSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSSID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t__bindgen_ty_1),
            "::",
            stringify!(BSSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t__bindgen_ty_1),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rssi_range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t__bindgen_ty_1),
            "::",
            stringify!(rssi_range)
        )
    );
}
#[test]
fn bindgen_test_layout_cy_wcm_scan_filter_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_scan_filter_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_scan_filter_t>(),
        40usize,
        concat!("Size of: ", stringify!(cy_wcm_scan_filter_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_scan_filter_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_scan_filter_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).param) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_filter_t),
            "::",
            stringify!(param)
        )
    );
}
#[doc = " Structure used for storing scan results."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_scan_result_t {
    #[doc = "< SSID (i.e., name of the AP). In case of a hidden AP, SSID.value will be empty and SSID.length will be 0."]
    pub SSID: cy_wcm_ssid_t,
    #[doc = "< Basic Service Set Identification (BSSID), i.e., MAC address of the AP."]
    pub BSSID: cy_wcm_mac_t,
    #[doc = "< RSSI in dBm. (<-90=Very poor, >-30=Excellent)."]
    pub signal_strength: i16,
    #[doc = "< Maximum data rate in kbps."]
    pub max_data_rate: u32,
    #[doc = "< Network type."]
    pub bss_type: cy_wcm_bss_type_t,
    #[doc = "< Security type."]
    pub security: cy_wcm_security_t,
    #[doc = "< Radio channel that the AP beacon was received on."]
    pub channel: u8,
    #[doc = "< Radio band."]
    pub band: cy_wcm_wifi_band_t,
    #[doc = "< Two-letter ISO country code in network byte order."]
    pub ccode: [u8; 2usize],
    #[doc = "< Indicates whether the scan results are from the same channel if flag is 1; otherwise from the beacon."]
    pub flags: u8,
    #[doc = "< Pointer to the received Beacon/Probe Response IE (Information Element)."]
    pub ie_ptr: *mut u8,
    #[doc = "< Length of the IE."]
    pub ie_len: u32,
}
#[test]
fn bindgen_test_layout_cy_wcm_scan_result_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_scan_result_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_scan_result_t>(),
        88usize,
        concat!("Size of: ", stringify!(cy_wcm_scan_result_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_scan_result_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_scan_result_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(SSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSSID) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(BSSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signal_strength) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(signal_strength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_data_rate) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(max_data_rate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bss_type) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(bss_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(security)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).band) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ccode) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(ccode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_ptr) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(ie_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_len) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_scan_result_t),
            "::",
            stringify!(ie_len)
        )
    );
}
#[doc = " Structure used to pass the device information to \\ref cy_wcm_wps_enrollee."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_wps_device_detail_t {
    #[doc = "< Device category."]
    pub device_category: cy_wcm_wps_device_category_t,
    #[doc = "< Device sub-category."]
    pub sub_category: u16,
    #[doc = "< Device name."]
    pub device_name: *const ::core::ffi::c_char,
    #[doc = "< Manufacturer details."]
    pub manufacturer: *const ::core::ffi::c_char,
    #[doc = "< Model name."]
    pub model_name: *const ::core::ffi::c_char,
    #[doc = "< Model number."]
    pub model_number: *const ::core::ffi::c_char,
    #[doc = "< Serial number."]
    pub serial_number: *const ::core::ffi::c_char,
    #[doc = "< Configuration methods."]
    pub config_methods: u32,
    #[doc = "< Operating system version."]
    pub os_version: u32,
    #[doc = "< Supported authentication types."]
    pub authentication_type_flags: u16,
    #[doc = "< Supported encryption types."]
    pub encryption_type_flags: u16,
    #[doc = "< Add configuration methods to probe response for Windows enrollees (Not compliant with WPS 2.0)."]
    pub add_config_methods_to_probe_resp: u8,
}
#[test]
fn bindgen_test_layout_cy_wcm_wps_device_detail_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_wps_device_detail_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_wps_device_detail_t>(),
        64usize,
        concat!("Size of: ", stringify!(cy_wcm_wps_device_detail_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_wps_device_detail_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_wps_device_detail_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_category) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(device_category)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sub_category) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(sub_category)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).device_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(device_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).manufacturer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(manufacturer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).model_name) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(model_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).model_number) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(model_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).serial_number) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(serial_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).config_methods) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(config_methods)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).os_version) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(os_version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).authentication_type_flags) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(authentication_type_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).encryption_type_flags) as usize - ptr as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(encryption_type_flags)
        )
    );
    assert_eq!(
        unsafe {
            ::core::ptr::addr_of!((*ptr).add_config_methods_to_probe_resp) as usize - ptr as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_device_detail_t),
            "::",
            stringify!(add_config_methods_to_probe_resp)
        )
    );
}
#[doc = " Structure used to receive the AP credential after WPS is completed successfully from \\ref cy_wcm_wps_enrollee."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_wps_credential_t {
    #[doc = "< AP SSID (name) - must be null-terminated."]
    pub ssid: cy_wcm_ssid_t,
    #[doc = "< AP security type."]
    pub security: cy_wcm_security_t,
    #[doc = "< AP passphrase - must be null-terminated."]
    pub passphrase: cy_wcm_passphrase_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_wps_credential_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_wps_credential_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_wps_credential_t>(),
        104usize,
        concat!("Size of: ", stringify!(cy_wcm_wps_credential_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_wps_credential_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_wps_credential_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ssid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_credential_t),
            "::",
            stringify!(ssid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_credential_t),
            "::",
            stringify!(security)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).passphrase) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wps_credential_t),
            "::",
            stringify!(passphrase)
        )
    );
}
#[doc = " Structure used to receive the information of the associated AP from \\ref cy_wcm_get_associated_ap_info()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_associated_ap_info_t {
    #[doc = "< Associated AP name."]
    pub SSID: cy_wcm_ssid_t,
    #[doc = "< BSSID (MAC address) of the associated AP."]
    pub BSSID: cy_wcm_mac_t,
    #[doc = "< Security of the associated AP. @see cy_wcm_security_t."]
    pub security: cy_wcm_security_t,
    #[doc = "< Channel width (bandwidth in MHz) of the AP."]
    pub channel_width: u16,
    #[doc = "< RSSI in dBm. (<-90=Very poor, >-30=Excellent)."]
    pub signal_strength: i16,
    #[doc = "< Radio channel of the AP."]
    pub channel: u8,
}
#[test]
fn bindgen_test_layout_cy_wcm_associated_ap_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_associated_ap_info_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_associated_ap_info_t>(),
        52usize,
        concat!("Size of: ", stringify!(cy_wcm_associated_ap_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_associated_ap_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_associated_ap_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).SSID) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(SSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).BSSID) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(BSSID)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).security) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(security)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel_width) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(channel_width)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).signal_strength) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(signal_strength)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_associated_ap_info_t),
            "::",
            stringify!(channel)
        )
    );
}
#[doc = " Structure used to receive the WLAN statistics of the given interface from the time the WLAN driver is up."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_wlan_statistics_t {
    #[doc = "< Total received bytes."]
    pub rx_bytes: u32,
    #[doc = "< Total transmitted bytes."]
    pub tx_bytes: u32,
    #[doc = "< Total received WLAN packets."]
    pub rx_packets: u32,
    #[doc = "< Total transmitted WLAN packets."]
    pub tx_packets: u32,
    #[doc = "< Total transmission retries."]
    pub tx_retries: u32,
    #[doc = "< Total failed packets."]
    pub tx_failed: u32,
    #[doc = "< Current transmitted data rate in Kbps"]
    pub tx_bitrate: u32,
}
#[test]
fn bindgen_test_layout_cy_wcm_wlan_statistics_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_wlan_statistics_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_wlan_statistics_t>(),
        28usize,
        concat!("Size of: ", stringify!(cy_wcm_wlan_statistics_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_wlan_statistics_t>(),
        4usize,
        concat!("Alignment of ", stringify!(cy_wcm_wlan_statistics_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(rx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_bytes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(tx_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rx_packets) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(rx_packets)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_packets) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(tx_packets)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_retries) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(tx_retries)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_failed) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(tx_failed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tx_bitrate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_wlan_statistics_t),
            "::",
            stringify!(tx_bitrate)
        )
    );
}
#[doc = " Structure used to fill the vendor information element (IE) as a part of starting SoftAP. \\ref cy_wcm_start_ap."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cy_wcm_custom_ie_info_t {
    #[doc = "< Unique identifier for the IE."]
    pub oui: [u8; 3usize],
    #[doc = "< Sub-type of the IE."]
    pub subtype: u8,
    #[doc = "< Pointer to IE data."]
    pub data: *mut ::core::ffi::c_void,
    #[doc = "< IE data length."]
    pub length: u16,
    #[doc = "< Mask of the IE details to be included \\ref cy_wcm_ie_mask_t"]
    pub ie_packet_mask: u16,
}
#[test]
fn bindgen_test_layout_cy_wcm_custom_ie_info_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_custom_ie_info_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_custom_ie_info_t>(),
        24usize,
        concat!("Size of: ", stringify!(cy_wcm_custom_ie_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_custom_ie_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_custom_ie_info_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).oui) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_custom_ie_info_t),
            "::",
            stringify!(oui)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).subtype) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_custom_ie_info_t),
            "::",
            stringify!(subtype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_custom_ie_info_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_custom_ie_info_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_packet_mask) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_custom_ie_info_t),
            "::",
            stringify!(ie_packet_mask)
        )
    );
}
#[doc = " Structure used to configure the access point. \\ref cy_wcm_start_ap."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cy_wcm_ap_config_t {
    #[doc = "< AP credentials."]
    pub ap_credentials: cy_wcm_ap_credentials_t,
    #[doc = "< Radio channel of the AP."]
    pub channel: u8,
    #[doc = "< IP settings of the AP interface."]
    pub ip_settings: cy_wcm_ip_setting_t,
    #[doc = "< Optional custom IE information to be added to the SoftAP."]
    pub ie_info: *mut cy_wcm_custom_ie_info_t,
}
#[test]
fn bindgen_test_layout_cy_wcm_ap_config_t() {
    const UNINIT: ::core::mem::MaybeUninit<cy_wcm_ap_config_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<cy_wcm_ap_config_t>(),
        176usize,
        concat!("Size of: ", stringify!(cy_wcm_ap_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<cy_wcm_ap_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(cy_wcm_ap_config_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ap_credentials) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_config_t),
            "::",
            stringify!(ap_credentials)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_config_t),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ip_settings) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_config_t),
            "::",
            stringify!(ip_settings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ie_info) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(cy_wcm_ap_config_t),
            "::",
            stringify!(ie_info)
        )
    );
}
